# Треугольник существует только тогда, когда сумма любых двух его сторон больше третьей. Дано a, b, c —
# стороны предполагаемого треугольника. Требуется сравнить длину каждого отрезка-стороны с суммой
# двух других. Если хотя бы в одном случае отрезок окажется больше суммы двух других, то треугольника
# с такими сторонами не существует. Отдельно сообщить является ли треугольник разносторонним,
# равнобедренным или равносторонним.

print("Введите длину сторон треугольника. Каждая на отдельной строке.")
a, b, c = int(input()), int(input()), int(input())
if a + b < c or a + c < b or b + c < a:
    print("Треугольника с такими сторонами не существует.")
elif a == b == c:
    print("Треугольник является равносторонним.")
elif a == b != c or a == c != b or b == c != a:
    print("Треугольник является равнобедренным.")
else:
    print("Треугольник является разносторонним.")
